# Используем официальный образ Python 3.11
FROM python:3.11-slim

# Устанавливаем переменную окружения, чтобы pip не кэшировал пакеты (опционально, но полезно для разработки)
ENV PIP_NO_CACHE_DIR=1

# Устанавливаем рабочую директорию внутри контейнера
WORKDIR /app

# Копируем файл зависимостей
COPY requirements.txt .

# Устанавливаем зависимости
RUN pip install --no-cache-dir -r requirements.txt

# Копируем весь исходный код проекта в контейнер
COPY . .

# Создаем директории для медиа-файлов и статики (если их нет)
RUN mkdir -p /app/staticfiles

# Открываем порт 8000 (порт, на котором будет слушать Django)
EXPOSE 8000

# Команда, которая выполнится при запуске контейнера
# Запускаем Django-сервер разработки
CMD ["python", "manage.py", "runserver", "0.0.0.0:8000"]